---
type: NonContinuousRailStructure
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 7
tags: [revit-api, class]
---

# NonContinuousRailStructure

`Autodesk.Revit.DB.Architecture.NonContinuousRailStructure` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddNonContinuousRail | 2019 | `public NonContinuousRailInfo AddNonContinuousRail ( string name , double height , double offset )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetNonContinuousRail | 2019 | `public NonContinuousRailInfo GetNonContinuousRail ( int index )` |
| Method | GetNonContinuousRailCount | 2019 | `public int GetNonContinuousRailCount ()` |
| Method | IsValidNonContinuousRailProfile | 2019 | `public bool IsValidNonContinuousRailProfile ( ElementId profileId )` |
| Method | RemoveNonContinuousRail | 2019 | `public void RemoveNonContinuousRail ( int index )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |